Documents/Удалить_АудитТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Удалить_АудитТорговыхТочек</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Comment>Торговый агент документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство_КолвоСКУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставкиОбласть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторОбластей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставкиРайон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторРайонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставкиГород</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторГородов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставкиУлица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставкиДом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставкиСтроение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Удалить_АудитТорговыхТочек/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьПоМенеджеруСервер()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КонтрагентыМенеджеры.Ссылка КАК Контрагент,
	|	КонтрагентыМенеджеры.Ссылка.АдресДоставкиОбласть,
	|	КонтрагентыМенеджеры.Ссылка.АдресДоставкиРайон,
	|	КонтрагентыМенеджеры.Ссылка.АдресДоставкиГород,
	|	КонтрагентыМенеджеры.Ссылка.АдресДоставкиУлица,
	|	КонтрагентыМенеджеры.Ссылка.АдресДоставкиДом,
	|	КонтрагентыМенеджеры.Ссылка.АдресДоставкиСтроение,
	|	КонтрагентыМенеджеры.Ссылка.Свойство_КолвоСКУ
	|ИЗ
	|	Справочник.Контрагенты.Менеджеры КАК КонтрагентыМенеджеры
	|ГДЕ
	|	КонтрагентыМенеджеры.Менеджер = &Менеджер
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентыМенеджеры.Ссылка.Наименование");
	
	Запрос.УстановитьПараметр("Менеджер", Объект.Менеджер);
	
	Объект.СтрокиДокумента.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоМенеджеру(Команда)
	ЗаполнитьПоМенеджеруСервер();
КонецПроцедуры
